<template>
  <transition name="el-zoom-in-top">
  <Row type="flex" justify="center" v-show="modal" style="padding: 1rem 5rem 1rem 1rem;background-color: #fff;border-radius: 10px">
    <i-col span="24">
      <p>一.免责声明</p>
      <ol>
        <li>
          用户在使用威海千投信息技术有限公司所提供的各项服务时，务必认真评估个人风险承受能力等情况。
           应该保证在充分了解创建模型和使用模型所必须相关组合技术和流程后做出是否使用的选择。 一旦选择使用，本公司将认为用户已经作了充分评估，
           并准备承担由此带来的相应结果。威海千投信息技术有限公司不承担任何因模型创建或者使用而引发的相关责任。
        </li>
        <li>
          威海千投信息技术有限公司不保证各网站的功能不含有缺陷或不发生中断、延迟或者失灵等情况，也不保证本公司的服务器、所使用的云服务器、
          信息数据传输系统不受病毒或其他软硬件故障的影响，用户须了解并同意，威海千投信息技术有限公司可能因公司、其他合作方或相关电信部门的互联网软硬件设备故障或失灵、
          或人为操作疏忽而全部或部分中断、延迟、遗漏、误导或造成资料传输或储存上的错误、或遭第三方侵入系统篡改或伪造变造资料等，用户若因此遭受损失（包括但不限于资料传输故障或储存错误
          、第三方或病毒侵入用户的系统等），本公司不承担任何责任。除非用户能证明，该损失是由于威海千投信息技术有限公司的故意行为所致。
        </li>
        <li>
          威海千投信息技术有限公司提供或展示的有关策略、模型或其他任何信息，只保证其生成期、回测期以及实盘期的相关记录准确、完整。 市场风险莫测，且用且谨慎
          任何历史情况都不能代表未来。本公司仅对各期的相关数据进行简单统计评估，用户须自行针对模型的延续性进行判断并承担相应的后果。
        </li>
        <li>
          凡通过威海千投信息技术有限公司与其他网站的链接，而获得其所提供的网上资料及内容，用户应该自己进行判别，
          并应当由该等网站对其提供内容承担相应责任，威海千投信息技术有限公司对此不承担任何责任。 威海千投信息技术有限公司提供超级链接至其它网站，
          并不视为同意、推荐、认可、保证或推介任何第三方或在其网站所提供的服务，产品， 亦不可视为与该第三方及网站有任何形式的合作。威海千投信息技术有限公司所提供的信息、
          服务、模型、接往第三者网站的超级链接及第三方所提供的商品、等一切内容，其完整性、正确性、及时性、知识产权的不受侵害性及第三者债务的履行及有无瑕疵等方面，
          不做任何保证，不负任何相关担保责任。
        </li>
        <li>
          威海千投信息技术有限公司所载商标、徽号和服务标志及其他任何数据的所有版权、专利权、知识产权及其它产权均属威海千投信息技术有限公司 或其关联公司所有。
          威海千投信息技术有限公司所载资料受版权保护。未经威海千投信息技术有限公司书面同意，不可将此等材料的任何部分修改、 翻版、储存、传送、复制、分发或以任何其它方式作商业或非商业用途。
        </li>
        <li>
          威海千投信息技术有限公司所登载的所有信息,比如:文字、图片、图表、指标等，不包含威海千投信息技术有限公司任何保证责任。对用户使用这些资料所产生的任何直接或间接的损失，
          威海千投信息技术有限公司或本公司相关人员不承担任何责任。
        </li>
        <li>威海千投信息技术有限公司拒绝为不同意本声明的用户提供任何服务。</li>
        <li>
          威海千投信息技术有限公司在中华人民共和国相关法律、法规允许的最大范围内还享有其他免责权利。
        </li>
      </ol>
    </i-col>
    <i-col span="24">
      <p>二.隐私声明</p>
      <ol>
        <li>本隐私权声明仅适用于威海千投信息技术有限公司旗下的网站。</li>
        <li>威海千投信息技术有限公司承诺保护用户的个人隐私，以下将阐述公司的隐私保护政策。 如果您对本隐私声明有任何疑问，请发送电子邮件至本公司官方邮箱<a
          href="mailto:info@hitqt.com">info@hitqt.com</a></li>
        <li>本公司网站在提供相关服务时,可能会提供给用户非本公司的链接或者网站,对于此类链接或者网站的隐私权政策,本公司不承担任何责任。同时建议用户在访问此类链接或者网站时查看每个链接或者网站的隐私权政策。
        </li>
        <li>
          威海千投信息技术有限公司仅保留满足用户的对本公司服务请求所必须的相关信息。用户可以访问威海千投信息技术有限公司的相关网站并了解本公司产品、
          服务的相关信息而无需提供个人信息。但是，如果用户欲加入本公司来使用一些服务,则需要用户提供必要的个人信息。
        </li>
        <li>用户需要保证在注册时提供给本公司的身份认证、联系方式等真实、完整、可靠、有效,并且建议用户及时更新信息,若由于用户信息不真实等导致的风险和损失,本公司概不负责,由用户自行承担。</li>
        <li>本公司有权利对用户身份信息进行核实。</li>
        <li>用户若发现任何非法使用本人账号或存在安全漏洞的情况，请立即告知本公司。由于第三方（包括第三方应用）访问或使用用户所注册账号发布信息所导致的纠纷或损失，应由该注册用户自行负责，
        威海千投信息技术有限公司不承担任何责任。</li>
        <li>威海千投信息技术有限公司会充分尊重和保护用户的个人信息,不会将您的个人信息出租、出售或向任何第三方泄露和传播，除非是在如下情况下：
          <div>a.用户自行公开</div>
          <div>b.用户同意本公司向他人公开</div>
          <div>c.根据相关法律法规需要披露,但是要遵从本公司的规定和服务程序</div>
          <div>d.用户因自身行为侵犯他人权利，千投量化网、法规进行披露</div>
        </li>
      </ol>
    </i-col>
  </Row>
  </transition>
</template>
<script>
  export default{
      data(){
          return{
              modal:true
          }
      }
  }
</script>
<style scoped>
  p{
    font-size: 1rem;
    font-weight: bold;
  }
  ol {
    margin-left: 1rem;
    list-style: decimal;
    font-size: 1rem;
  }
  li{
    margin-top: .5rem;
  }
</style>

