<template>
  <transition name="el-zoom-in-top">
    <Row type="flex" justify="center" v-show="modal" style="padding: 1rem 5rem 1rem 1rem;background-color: #fff;border-radius: 10px">
      <i-col span="24">
        <div id='preview-contents' class='note-content'>
          <h1 id="特色功能">特色功能———智能回测</h1>
          <h2 id="什么是智能回测">什么是智能回测</h2>
          <p>采用机器学习算法，启发式寻找最优模型参数的功能。 <br>
            简而言之：您选好指标后，启动智能回测。系统将帮您调整参数，用以最大化您模型的收益率、最小化您模型的回撤。</p>
          <h2 id="智能回测解决的问题">智能回测解决的问题</h2>
          <p>创建一个优秀的模型，一般要经历： 运行回测 -&gt; 得到反馈 -&gt; 根据反馈调整参数 -&gt; 运行回测 的不断循环，如下图棕色虚线框区域所示：</p>
          <p><img src="../../img/process.png" alt="Alt text"></p>
          <p>虽然您已经具备丰富的经验和调参技巧，但这个循环迭代的过程仍然显得枯燥和乏味，且需要投入巨大的时间和精力。</p>
          <p>
            智能回测就是为了自动化这个过程而被开发出来，该功能可以提高您的建模效率、帮助您将精力更多地集中在指标的组合探索中并加速获得反馈的速度。千投经历数月地调试和测试，反复比对打磨多套机器学习算法及参数，最终选择最适合的纳入进系统中并会不断尝试升级和优化，力争为您带来更优秀的智能回测体验。</p>
          <h2 id="智能回测怎么用">智能回测怎么用</h2>
          <p>
            智能回测创建模型的过程与单次回测过程相似：<strong>登陆千投量化</strong> -> <strong>单击顶端”创建模型”</strong> -&gt; <strong>按需选择入市、出市、二次筛选、风控等指标</strong> -&gt; <strong>单击右下角”智能回测”按钮</strong> -&gt; <strong>按需选择初、中、高三个级别的智能回测</strong>即可。</p>
          <p>
            系统会自动跳转到对应页面，等待少许用以初始化的时间后，您便能看到智能回测每一次”探索调参”的结果，每一个结果都对应一次单次回测。您可以选择保持该页面用以观察智能回测运行的过程，也可以选择关闭该页面，均不会影响智能回测的正常运行。</p>
          <blockquote>
            <p>您可通过悬浮在网页左侧的小按钮，弹出并跳转至智能回测页面，查看最新的进度。</p>
          </blockquote>
          <p>
            当智能回测结束，您可以查看并立刻重建任意一次回测的结果，页面提供了基础的排序功能，您可以按照自己的需求寻找最心仪的模型。另外，您也可以通过左下角的导出按钮将本次结果全部导出至Excel，通过Excel匹配复杂的搜索需求。</p>
          <blockquote>
            <p>小技巧：智能回测过程中，并不需要您保持网页打开状态。您可以在睡前下达智能回测的命令并关闭网页，等您第二天起来即可查看智能回测的结果。 <br>
              小技巧：智能回测的回测区间范围没有限制，您可以在系统数据支持的范围内（2006年1月1日至今）选择心仪的时间段进行智能回测。千投建议您选择2-5年跨度，涵盖一个牛市及一个熊市的时间范围，例如：2007-01-09至2009-03-24。
            </p>
          </blockquote>
          <h2 id="什么是智能回测锁机制">什么是智能回测”锁”机制</h2>
          <p>通过”锁”机制，您可以固定某一个或多个指标的参数不变，在智能回测”探索调参”过程中仅会尝试调整未加”锁”的指标。 <br>
            简而言之：”锁”机制就是告诉智能回测哪些指标的参数可以改变，哪些指标的参数不能改变。</p>
          <h2 id="智能回测锁机制解决的问题">智能回测”锁”机制解决的问题</h2>
          <p>在创建模型初期，您尚未确定模型中各个指标最佳的参数，这时需要通过反复回测来不断寻找适宜的参数组合。 <br>
            经过一段时间的计算和探索进入了创建模型中期，您已经确定了一个或者数个指标的参数。若此时再使用智能回测，系统会打乱指标的参数”从头”开始进行参数调优，这显然是令人沮丧的。</p>
          <blockquote>
            <p>这好比玩游戏不能存档一样，一旦攻关”boss”失败，就得回新手村从头开始。</p>
          </blockquote>
          <p>“锁”机制就是为了解决上述问题而被开发出来，它可以使智能回测胜任创建模型中期的实际情况：有的指标参数可变，有的不可变，帮助您更好地驾驭智能回测并提高建模中期的效率。</p>
          <h2 id="智能回测锁机制怎么使用">智能回测”锁”机制怎么使用</h2>
          <p>“创建模型”页面，每一个指标右侧都带着一个类似锁的图标。您只需要单击对应的图标，即可给指标加上”锁”；再次单击即可取消”锁”。</p>
          <blockquote>
            <p>“锁”和”不锁”两种状态的图标差异很大，您不必担心混淆的问题。</p>
          </blockquote>
          <h2 id="智能回测的收费模式是什么">智能回测的收费模式是什么</h2>
          <p>智能回测有三种运行模式：初级、中级、高级，分别对应了三种收费点数：5点、100点、200点。</p>
          <blockquote>
            <p>点数即为千投量化点数，您可以在顶端导航栏找到充值入口。 <br>
              若您尚未购买回测卡，您每天都能免点数执行3次初级智能回测，该次数不会累加至第二天。 <br>
              若您购买了单次回测5年卡，在回测卡有效期内，您每天都能免点数执行5次初级智能回测、1次中级智能回测，该次数不会累加至第二天。 <br>
              若您购买了单次回测10年卡，在回测卡有效期内，您每天都能免点数执行10次初级智能回测、3次中级智能回测，该次数不会累加至第二天。</p>
          </blockquote>
          <p>我们定义 年/次 为智能回测的单位，初级、中级、高级分别对应：300 年/次、 5000 年/次、 20000 年/次。 <br>
            年/次 的定义为：您智能回测的次数 * 您智能回测选择的回测区间长度。</p>
          <p>
            例1：您选择以2016-01-01为回测起点、2017-01-01为回测终点（跨度刚好为1年）进行一次初级智能回测，初级模式含有300年/次，则智能回测将会执行 300 / 1 = 300 次用以寻找最优的模型参数。</p>
          <p>
            例2：您选择以2015-04-01为回测起点、2017-01-01为回测终点（跨度约为1.75年）进行一次高级智能回测，高级模式含有20000年/次，则智能回测将会执行 20000 / 1.75 ≈ 11429 次用以寻找最优的模型参数。</p>
          <h2 id="千投对于智能回测的期望">千投对于智能回测的期望</h2>
          <ol>
            <li rel="1">千投期望智能回测能够进一步降低量化的”门槛”，使得更多的朋友参与进来并享受量化的果实。</li>
            <li rel="2">创建并打磨一个可实战的模型，终究是一件需要投入大量时间、精力的事情。千投期望智能回测能进一步帮助您提高效率、减少不必要的精力付出，让机器去承担繁重的调参工作。</li>
          </ol>
        </div>
      </i-col>
    </Row>
  </transition>
</template>
<script>
  export default{
    data(){
      return {
        modal: true
      }
    }
  }
</script>
<style rel="stylesheet" lang="scss" scoped>
p,ol,h2{
  font-size: 1rem;
  margin-top: .5rem;
}
blockquote{
  color: #ff0000;
}
  img {
    width: 70%;
  }
  h1{
    text-align: center;
  }
</style>
