<template>
  <transition name="el-zoom-in-top">
    <Row type="flex" justify="center" v-show="modal"
         style="padding: 1rem 5rem 1rem 1rem;background-color: #fff;border-radius: 10px">
      <i-col span="24">
        <section id="platform">
          <h1>第一类:平台类</h1>
          <section>
            <h2>1、千投量化平台的理念</h2>
            <p>
              千投量化平台致力于提供便捷、强大、急速的量化服务，以”使更多的人享受量化的果实”为使命，打造专业的量化模型开发实践与研究学习平台。
            </p>
          </section>
          <section>
            <h2>2、千投量化平台提供的服务</h2>
            <p>您在千投量化平台中享有以下服务：</p>
            <p>第一、快速更新的高质量数据</p>
            <ul>
              <li>
                千投量化平台从国内知名数据提供商处获取数据，并做了大量数据清洗、数据校验工作，从而使您的模型开发建立在更高质量的数据支撑之上。


              </li>
              <li>
                千投量化平台在力求数据质量的同时，追求数据更快更新的速度，提高您的使用体验。


              </li>
            </ul>
            <p>第二、简易强大的模型开发与回测</p>
            <ul>
              <li>
                千投量化平台提供了高效、便捷、友好的交互界面，几乎不需要额外的学习成本，您就可以
                轻松使用并按照您的实际需要创建属于自己的量化模型。







              </li>
              <li>
                千投量化平台提供了精准、快速、强大的回测功能，您可以很方便地查看详尽的模型报告，
                有效地帮助您不断完善自己的模型。






              </li>
            </ul>
          </section>
          <section>
            <h2>3、模型是否安全</h2>
            <p>
              尊重并保护用户隐私是千投量化平台不变的基本原则，您的所有数据均受到千投量化平台的技术保护，我们为此付出了大量的努力。在使用千投量化平台中，您的数据传输全程通过https通道加密，您的模型参数均被千
              投量化平台内部算法加密保护，隐私数据加密存储于国内领先的云服务商处。并且千投量化平台会定期进行数据容灾备份，竭尽全力保障您的数据安全。
            </p>
          </section>
          <section>
            <h2>4、千投量化平台提供哪些数据</h2>
            <p>
              千投量化平台基于内部高质量的沪深行情数据，构建了一系列指标供您使用，支持从2006年1月4日
  开始至当前日期范围内的回测。
            </p>
          </section>
        </section>
        <section id="rule">
          <h1>第二类:规则类</h1>
          <section>
            <h2>1、千投量化平台如何选股</h2>
            <p>千投量化平台严格按照您设定的指标集合、指标组合逻辑、运行参数（包含卖出费率、买入费率、回测区间等）进行选股及回测，并展示详尽的回测报告。</p>
            <p>当个股当日的走势（收盘后判断）符合您设定的参数时，模型在下一个交易日开盘执行买入操作并
          持有数个交易日（该数量为设定的持有期）。持有期结束，若该个股仍然符合您设定的参数，则继续持有一个交易日，一直到其不符合为止。</p>
          </section>
          <section>
            <h2>2、千投量化平台如何计算模型收益</h2>
            <p>千投量化平台在回测过程中，以个股开盘价执行卖出、买入操作，每一次调仓换股均考虑手续费、印花税、滑点、一字涨跌停、停复牌、实际可买入量等因素。经过大量实盘测试验证，千投量化平台的回测算法更加贴近真实交易。</p>
          </section>
          <section>
            <h2>3、停牌股票如何处理</h2>
            <p>模型回测中发现有股票停牌，则认为无法卖出，会继续持有。</p>
          </section>
          <section>
            <h2>4、ST股票如何处理</h2>
            <p>模型回测中会根据当时股票是否ST来判断涨跌停的价格，您可以在”股票池筛选类”指标中选择不买入ST股票。</p>
          </section>
          <section>
            <h2>
              5、涨跌停一字板如何处理
            </h2>
            <p>模型回测中会严格按照涨停无法买入、跌停无法卖出的基本逻辑执行。</p>
            <p>模型提示买入的股票在交易日涨停开盘（无论是否一字涨停），回测算法会跳过并按照您设定的二次筛选指标寻找下一个符合条件的股票。</p>
            <p>模型提示卖出的股票在交易日跌停开盘（无论是否一字跌停），回测算法认为无法卖出，会继续持有该股票。</p>
            <p>若当前持仓股票已经达到了您设定的最大持股数量，则回测算法也不会在这个交易日执行其他买入操作。</p>
          </section>
          <section>
            <h2>6、为什么一定要选择一个二次筛选指标</h2>
            <p>当模型按照您设定的参数在某个交易日选出数个股票后，您必须通过二次筛选指标告知模型优先买入哪个股票，以使回测可以正常进行。</p>
          </section>
          <section>
            <h2>7、如何处理分红配股对涨跌幅的影响</h2>
            <p>模型回测中使用的数据为精准的后复权数据，剔除了分红配股的影响，保证了涨跌幅的计算可靠。</p>
          </section>
          <section>
            <h2>8、我应该如何操作，才能紧跟模型的收益</h2>
            <p>
              模型会在当日收盘后计算下一个交易日的调仓换股，计算完毕后，会显示需要卖出、买入、无法买入时备选的股票列表（已按优先级排序）。在下一个交易日开盘时，您需要按照模型的计算结果卖出股票，再按照您设定的最大持股数和当前持股数量计算可用资金的平均值，该平均值即为模型用来购买需要买入股票的资金。</p>
            <p>第一个例子：</p>
            <p>
              假如您在2016­01­04这天按照模型持有600004、600006、600007、600008、600009 这5只股票，模型在这天盘后计算完毕，提示您下一个交易日卖出600004、600006，买入300001、300002，备选股票列表为300001、300002、300003、300004。</p>
            <p>
              您在2016­01­05这天集合竞价时间顺利卖出了600004、600006，卖出后账户可用资金为15万，当前持有600007、600008、600009这3支股票，您模型设定的最大持股数为5，还需要买入2支股票，则每一支股票购买的总资金为15 / 2 = 7.5万元，分别用以买入300001、300002。若300001、300002出现了停牌、涨停开盘的情况，则按需按顺序买入300003、300004即可。
              </p>
            <p class="explain">
              7.5万不一定为您总资产的五分之一，千投量化平台的回测算法侧重于更少的操作和更大的资金利用率，您不必将资产等分于持仓的个股，因为精确等分会使得您必须执行如“卖出100股，买入100股”的操作，增加了交易成本且操作较为繁琐。选股条件严格的模型有时会出现可买的股票数量少于最大可购买数量的情况，为避免资金分配过度失衡，回测算法会在此时选择闲置资金。关于这种情况的详细解释，请您看第二个例子。</p>
            <p>第二个例子：</p>
            <p>
              假如您在2016­01­04这天正式实盘跟随模型，这天模型选出了3支股票并提示于2016­01­05日开盘买入，模型的最大持股数量为5，您用来跟随模型的总资金为100万。则每一支股票可购买的资金量为1000000 / 5 = 200000，2016­01­05日执行买入操作后，还闲置了40万资金和数百到数千不等的”零头”（因无法全部买入股票而余下的少部分），姑且算作1千元。</p>
            <p>
              2016­01­05日收盘后，模型提示卖出1支股票，并买入另外2支股票。2016­01­06日开盘执行卖出操作后，该股票盈利1万元，则当前您的可用资金为40 万元 + 1 千元 + 20 万本金 + 1 万盈利 = 61万零 1 千元。当前持股数量为2，最大持股数为5，还需要买入3支股票，每支股票的可用资金为611000 / 3 ≈ 203666 元。按照模型提示买入股票后，您应闲置了203666元资金和数百到数千不等的”零头”。</p>
            <p class="explain">
              闲置资金是为了避免过度分配失衡的情况出现，例如：您设定模型最大持股数量为5，若在第一个交易日只选中了3支股票，全仓等分资金买入后，在第二个交易日模型提示额外买入另外2支股票，此时的可用资金可能只有数百到数千不等，执行买入操作后，这2支股票纵使涨停，对于您当日的收益也无法造成太大的影响。</p>
          </section>
          <section>
            <h2>9、为什么回测报告中的回测起点、回测终点与我设定的差了几天</h2>
            <p>
              您在创建模型界面设定的回测起点、回测终点表示了一个时间范围的限定，千投量化平台会在这段时间范围内寻找临近的交易日作为回测的起点和终点。例如：您选择2016­01­03日作为回测终点，这天为节假日，故而实际回测时会设定为2015­12­31日（最近的交易日）。</p>
            <p>
              此外，您设定的回测起点临近第一个交易日，将作为第一个选股日用以根据您设定的参数选股，它的下一个交易日为操作上的第一个交易日，千投量化平台将这个交易日作为报表生成的起点。例如：您选择2016­01­04日作为起点，那么实际报表会以2016­01­05作为起点执行操作。</p>
          </section>
        </section>
        <section>
          <h1>第三类:参数类</h1>
          <section>
            <h2>1、什么是持有期</h2>
            <p>
              当模型买入一支股票，默认持有的交易日数量。无论该股票走势如何，在持有期内不会卖出。持有期结束，模型会判断该股票是否仍然符合设定的参数，若不符合，则执行卖出操作。持有期从买入时开始计数，即：买入的交易日为持有期的第一天。</p>
            <p class="explain">
              若您设定了风控指标，并且风控指标提示卖出，无论持有的股票是否仍然在持有期内，均会执行卖出操作。
            </p>
          </section>
          <section>
            <h2>2、什么是回测起点、回测终点</h2>
            <p>本次回测的起始日期和本次回测的终止日期，千投量化平台目前支持从2006年1月4日至当前最新已收盘交易日范围内的回测计算。</p>
            <p class="explain">
              您可以任意选择一个时间范围进行回测，检验您的模型在各个行情趋势下的表现，帮助您客观、综合地评价模型。
            </p>
          </section>
          <section>
            <h2>3、什么是买入费率、卖出费率</h2>
            <p>本次回测中，执行买入、卖出操作时所需要付出的交易费用，单位为”万分之”。默认买入费率为万分之三，卖出费率为千分之十三（万分之三的手续费加千分之一的印花税）。</p>
          </section>
          <section>
            <h2>4、什么是模型压力费率</h2>
            <p>
              在实际交易中，往往无法刚好买入或者卖出于指定的价格上，会根据实际情况产生一定的价格差距，该价格差距使得您无法紧跟模型的收益。模型压力费率正是为解决该问题而设定，其每增加一，表示同时增加万分之一的买入费率和万分之一的卖出费率。</p>
            <p class="explain">
              千投量化平台建议您增加模型压力费率，直至每一次调仓换股时，您的实际当日收益略大于模型计算的值。这样可以最大程度地帮您抹平由于操作而造成的收益差距，提高回测报告的可靠性。
            </p>
          </section>
          <section>
            <h2>5、什么是最大每日持股数</h2>
            <p>本次回测中，各个交易日允许最大持有的股票数量。</p>
            <p>例如：最大每日持股数为5，当模型按照您设定的指标，在第一个交易日选出了10个股票并按照二次筛选指标排序后，只会对前5个股票执行买入操作。</p>
          </section>
        </section>
        <section>
          <h1>第四类:功能指标类</h1>
          <section>
            <h2>1、什么是二次筛选指标</h2>
            <p>当模型按照您设定的参数在某个交易日选出股票后，二次筛选指标帮助模型判断这些股票买入的优先级。</p>
            <p>例如：最大每日持股数为5，模型在第一个交易日选出了10个股票，此时模型需要按照您设定的二次筛选指标来对这10个股票排序，对前5个股票执行买入操作。</p>
          </section>
          <section>
            <h2>2、什么是风控指标</h2>
            <p>风控是风险控制的缩写，当某个交易日不满足您设定的风控指标，则模型会执行清仓操作（无论股票是否在持有期内），尝试卖出持有的所有股票（停牌、跌停开盘的股票无法卖出）。</p>
            <p>
              风控指标帮助您更好的控制系统性风险，提高模型的稳定性并缩小模型的最大回撤。
            </p>
          </section>
          <section>
            <h2>3、“并且、或者、依次剔除掉”是什么</h2>
            <p>在千投量化内部，将该功能简称为：”与或非”功能。您可以通过”与或非”功能来选择指标之间的组合逻辑。</p>
            <p>例如：A指标为”总市值介于10亿至20亿”，B指标为”总市值介于15亿至25亿之间”。当您构建的模型同时设定了A和B</p>
            <ul>
              <li>选择”并且”，表示您希望模型选出总市值介于15亿至20亿之间的股票。</li>
              <li>选择”或者”，表示您希望模型选出总市值介于10亿至25亿之间的股票。</li>
              <li>选择”依次剔除掉”，当A指标在B指标的上方，表示您希望选出总市值介于10亿至15亿之间的股票。</li>
              <li>选择”依次剔除掉”，当B指标在A指标的上方，表示您希望选出总市值介于20亿至25亿之间的股票。</li>
            </ul>
            <p>千投量化平台允许您将已保存的模型作为指标添加进新的模型中，且不会影响已保存模型内部的”与或非”设定。您可以通过这个技巧组合出极复杂的选股逻辑。</p>
          </section>
        </section>
        <section>
          <h1>第五类:选股指标类</h1>
          <section>
            <h2>1、倒数第N个交易日怎么理解</h2>
            <p>模型选中股票的交易日即为倒数第一个交易日。</p>
            <p>
              举个例子：模型在2016­01­08买入股票A，那么2016­01­07即为模型选中股票A的日期（收盘后计算，下一个交易日开盘执行），同时也是倒数第一个交易日。倒数第二个交易日为2016­01­06，倒数第三个交易日为2016­01­05，以此类推。</p>
          </section>
          <section>
            <h2>2、按时间顺序怎么理解</h2>
            <p>指标中常常出现的”倒数”，指的是由现在朝过去方向数。而”按照时间顺序”刚好与之相反，它指的是由过去朝现在数，也即”正数”。</p>
            <p>
              举个例子：模型在2016­01­08买入股票A，假设仅有一个指标起作用：”倒数第N1~第N2个交易日的收盘价按时间顺序依次下降“，参数为1、3，倒数第1~第3个交易日分别为：2016­01­07、2016­01­06、2016­01­05。则模型中的含义为：股票A于2016­01­05的收盘价大于等于股票A于2016­01­06的收盘价，并且股票A于2016­01­06的收盘价大于等于股票A于2016­01­07的收盘价。</p>
          </section>
          <section>
            <h2>3、为什么经典指标选出的股票与我检验的不一致</h2>
            <p>
              部分经典类指标与计算的时间区间强相关，例如：MACD、KDJ等，千投量化平台会严格按照您设定的回测起点、回测终点截取数据并重新计算经典指标，由于经典指标本身计算公式的限定，故而无法与第三方交易软件显示的指标保持完全一致（计算的起点不一样）。</p>
            <p class="explain">
              这并不会影响您的使用，经典指标的内部逻辑、涨跌判断逻辑并没有任何人为修改。
            </p>
          </section>
        </section>
      </i-col>
    </Row>
  </transition>
</template>
<script>
  export default{
    data(){
      return {
        modal: true
      }
    }
  }
</script>
<style rel="stylesheet" lang="scss" scoped>
  * {
    margin-top: .5rem;
  }

  h1 {
    color: #2d8cf0;
  }

  p {
    font-size: 1rem;
  }

  .explain {
    &:before {
      content: '注:';
      font-weight: bold;
      /*color: #FF0000;*/
    }
    /*margin-left: 1rem;*/
    color: #FF0000;
  }

  ul {
    margin-left: 3rem;
    font-size: 1rem;
    list-style: disc;
  }
</style>


